In [131]:
import pandas as pd 
from google.colab import files

ModuleNotFoundError: No module named 'google.colab'

In [130]:
uploaded = files.upload()

NameError: name 'files' is not defined

In [132]:
df = pd.read_csv('data.csv')
df.head()

            Nom   Taile   Poids     Age Performance
0  Ibrahim Issa    1m78    70kg  28 ans       Bonne
1      Ali Baba     1.8    65.5      27  Acceptable
2   Diop Ndiaye  1.80cm  65.5kg    28.5     Moyenne
3   moussa Sall    0.65    65.5  32 ANS      Faible
4    Haroune Ba    1,65    65.5    29,7       Moyen

In [129]:
df.columns

Index(['Nom', 'Taile', 'Poids', 'Age', 'Performance'], dtype='object')

---
Pour la colonne **Nom**
- Mettre tout en **minuscule** 
- Mettre tout en **majuscule**
- Mettre le premier caractere de chaque mot en **majuscule**

In [125]:
df['Nom'] = df['Nom'].str.lower()
df

            Nom   Taile   Poids   Age Performance
0  ibrahim issa    1m78    70kg    28       Bonne
1      ali baba     1.8    65.5    27  Acceptable
2   diop ndiaye  1.80cm  65.5kg  28.5     Moyenne
3   moussa sall    0.65    65.5    32      Faible
4    haroune ba    1,65    65.5  29,7       Moyen
5         james    3.65   200kg    33      faible

In [127]:
df['Nom'] = df['Nom'].str.upper()
df

            Nom   Taile   Poids   Age Performance
0  IBRAHIM ISSA    1m78    70kg    28       Bonne
1      ALI BABA     1.8    65.5    27  Acceptable
2   DIOP NDIAYE  1.80cm  65.5kg  28.5     Moyenne
3   MOUSSA SALL    0.65    65.5    32      Faible
4    HAROUNE BA    1,65    65.5  29,7       Moyen
5         JAMES    3.65   200kg    33      faible

In [128]:
df['Nom'] = df['Nom'].str.title()
df

            Nom   Taile   Poids   Age Performance
0  Ibrahim Issa    1m78    70kg    28       Bonne
1      Ali Baba     1.8    65.5    27  Acceptable
2   Diop Ndiaye  1.80cm  65.5kg  28.5     Moyenne
3   Moussa Sall    0.65    65.5    32      Faible
4    Haroune Ba    1,65    65.5  29,7       Moyen
5         James    3.65   200kg    33      faible

---
- Corriger toutes les erreurs de la colonne **Age**

In [112]:
df.iloc[0]

Nom            Ibrahim Issa
Taile                  1m78
Poids                  70kg
Age                  28 ans
Performance           Bonne
Name: 0, dtype: object

In [113]:
df

            Nom   Taile   Poids     Age Performance
0  Ibrahim Issa    1m78    70kg  28 ans       Bonne
1      Ali Baba     1.8    65.5      27  Acceptable
2   Diop Ndiaye  1.80cm  65.5kg    28.5     Moyenne
3   Moussa Sall    0.65    65.5  32 ANS      Faible
4    Haroune Ba    1,65    65.5    29,7       Moyen
5         James    3.65   200kg      33      faible

In [114]:
df.dtypes

Nom            object
Taile          object
Poids          object
Age            object
Performance    object
dtype: object

In [115]:
df['Age']

0    28 ans
1        27
2      28.5
3    32 ANS
4      29,7
5        33
Name: Age, dtype: object

---
- Les filtres

In [116]:
df[df['Age'].str.contains('ANS') | df['Age'].str.contains('ans')]

            Nom Taile Poids     Age Performance
0  Ibrahim Issa  1m78  70kg  28 ans       Bonne
3   Moussa Sall  0.65  65.5  32 ANS      Faible

In [117]:
df['Age'].str.split()[0]

['28', 'ans']

In [124]:
df['Age']

0      28
1      27
2    28.5
3      32
4    29,7
5      33
Name: Age, dtype: object

In [119]:
a = df['Age'].str.split()[0]
a

['28', 'ans']

In [120]:
df['Age']

0    28 ans
1        27
2      28.5
3    32 ANS
4      29,7
5        33
Name: Age, dtype: object

In [135]:
for i, j in enumerate(df['Age']):
    a = j.split()[0].replace('ans','')
    df.loc[i,'Age'] = a

In [136]:
df

            Nom   Taile   Poids   Age Performance
0  Ibrahim Issa    1m78    70kg    28       Bonne
1      Ali Baba     1.8    65.5    27  Acceptable
2   Diop Ndiaye  1.80cm  65.5kg  28.5     Moyenne
3   moussa Sall    0.65    65.5    32      Faible
4    Haroune Ba    1,65    65.5  29,7       Moyen
5         James    3.65   200kg    33      faible

In [137]:
for i, j in enumerate(df['Age']):
    a = j.split()[0].replace(',','.')
    df.loc[i,'Age'] = a

In [139]:
df['Age'] = df['Age'].astype(float)

In [140]:
df

            Nom   Taile   Poids   Age Performance
0  Ibrahim Issa    1m78    70kg  28.0       Bonne
1      Ali Baba     1.8    65.5  27.0  Acceptable
2   Diop Ndiaye  1.80cm  65.5kg  28.5     Moyenne
3   moussa Sall    0.65    65.5  32.0      Faible
4    Haroune Ba    1,65    65.5  29.7       Moyen
5         James    3.65   200kg  33.0      faible